# GetStyle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..GetStyle Method
ScheduleField Class See Also
---
Gets the style of this field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public TableCellStyle GetStyle()
```

Visual Basic
---
```text
Public Function GetStyle As TableCellStyle
```

Visual C++
---
```text
public:
TableCellStyle^ GetStyle()
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace